package ru.schoolbot.constant;

import java.util.Arrays;
import java.util.List;

public class VarConstant {
    public static final String START = "/start";

    public static final String TABLE = "Посмотреть расписание на завтра.";

    public static final String TAKE_CLASS_A = "На экране представлена первая часть классов \nКакой класс вас интересует?";

    public static final String TAKE_CLASS_B = "На экране представлена вторая часть классов \nКакой класс вас интересует?";

    public static final String NEXT_CLASS = ">>Еще";
    public static final String OLD_CLASS = "<<Назад";
    public static final List<String> CLASS_GROUPS_A = Arrays.asList("5а", "5б", "5в", "6а", "6б", "6в",
            "7а", "7б", "7в", ">>Еще");

    public static final List<String> CLASS_GROUPS_B = Arrays.asList("<<Назад", "8а", "8б", "8в", "9а", "9б", "9в",
            "10а", "10б", "11");

    // Расписание предметов в классах
    public static final List<String> TABLE_CLASS = Arrays.asList(
            "1.Математика\n2.Русский язык\n3.Физкультура", // 5a
            "1.Литература\n2.Английский язык\n3.Музыка", // 5б
            "1.История\n2.География\n3.Химия", // 5в
            "1.Физика\n2.Алгебра\n3.Русский язык", // 6а
            "1.Биология\n2.Геометрия\n3.Английский язык", // 6б
            "1.Информатика\n2.Химия\n3.Физкультура", //6в
            "1.Русский язык\n2.Физика\n3.Математика", //7а
            "1.Английский язык\n2.География\n3.Биология", //7б
            "1.Литература\n2.История\n3.Музыка", //7в
            "1.Математика\n2.Химия\n3.Физика", //8а
            "1.Русский язык\n2.Биология\n3.Литература", //8б
            "1.Английский язык\n2.Физкультура\n3.История", //8в
            "1.Физика\n2.Математика\n3.Химия", //9а
            "1.Русский язык\n2.Биология\n3.Английский язык", //9б
            "1.География\n2.Литература\n3.Музыка", // 9в
            "1.Математика\n2.Физика\n3.История", // 10а
            "1.Русский язык\n2.Английский язык\n3.Биология", // 10б
            "1.Физика\n2.Математика\n3.Химия"); // 11
}

